run/tutorials/compressible/sonicFoam/ras/nacaAirfoil/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 25000;

boundaryField
{
    INLE1
    {
        type            inletOutlet;
        inletValue      uniform 25000;
        value           uniform 25000;
    }
    OUTL2
    {
        type            inletOutlet;
        inletValue      uniform 25000;
        value           uniform 25000;
    }
    SYMP3
    {
        type            empty;
    }
    WALL10
    {
        type            compressible::epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 25000;
    }
}


// ************************************************************************* //
